/*
SQLyog Ultimate v13.1.1 (64 bit)
MySQL - 5.5.53 : Database - test
*********************************************************************
*/

/*!40101 SET NAMES utf8 */;

/*!40101 SET SQL_MODE=''*/;

/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
CREATE DATABASE /*!32312 IF NOT EXISTS*/`test` /*!40100 DEFAULT CHARACTER SET utf8 */;

USE `test`;

/*Table structure for table `ids` */

DROP TABLE IF EXISTS `ids`;

CREATE TABLE `ids` (
  `id` varchar(18) NOT NULL,
  `area` varchar(20) NOT NULL,
  `birthyear` varchar(16) NOT NULL,
  `birthmonth` varchar(8) NOT NULL,
  `birthday` varchar(8) NOT NULL,
  `gender` varchar(16) NOT NULL,
  `gentime` varchar(16) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

/*Data for the table `ids` */

insert  into `ids`(`id`,`area`,`birthyear`,`birthmonth`,`birthday`,`gender`,`gentime`) values 
('411722199909168839','上蔡县','1999','09','16','male','1623314504'),
('610100200605070606','西安市','2006','05','07','female','1623313106'),
('410928200308047082','濮阳县','2003','08','04','female','1623312998'),
('410928200308043823','濮阳县','2003','08','04','female','1623312994'),
('522701202005053907','都匀市','2020','05','05','female','1623312873'),
('410902199210162083','华龙区','1992','10','16','female','1623312371'),
('410527201801063306','内黄县','2018','01','06','female','1623311125'),
('410922202501014291','清丰县','2025','01','01','male','1623311095'),
('410922200106017143','清丰县','2001','06','01','female','1623311077'),
('410527202501012456','内黄县','2025','01','01','male','1623311077'),
('410527202501014515','内黄县','2025','01','01','male','1623311055'),
('410527202501013598','内黄县','2025','01','01','male','1623311021'),
('41052720250101323X','内黄县','2025','01','01','male','1623310948'),
('410922200212013090','清丰县','2002','12','01','male','1623310894'),
('410902202501019214','华龙区','2025','01','01','male','1623308002'),
('410922200212011052','清丰县','2002','12','01','male','1623310777'),
('410902202501012055','华龙区','2025','01','01','male','1623307998'),
('41090220250101099X','华龙区','2025','01','01','male','1623307994'),
('410902202501017593','华龙区','2025','01','01','male','1623307989'),
('410902202501013509','华龙区','2025','01','01','female','1623307982'),
('410902199210162403','华龙区','1992','10','16','female','1623307892'),
('410523200202287316','汤阴县','2002','02','28','male','1623307848'),
('410702200002291475','红旗区','2000','02','29','male','1623307744'),
('411722199909166956','上蔡县','1999','09','16','male','1623314508'),
('411722199909166171','上蔡县','1999','09','16','male','1623314512'),
('71000019720918009X','台湾省','1972','09','18','male','1623314528'),
('110000200210128515','北京市','2002','10','12','male','1623314560'),
('410923200311188706','南乐县','2003','11','18','female','1623314588'),
('410927200807200129','台前县','2008','07','20','female','1623314607'),
('371721196606066672','曹县','1966','06','06','male','1623314767'),
('320900198910188496','盐城市','1989','10','18','male','1623314810'),
('320500199010185372','苏州市','1990','10','18','male','1623314824'),
('341300199409205754','宿州市','1994','09','20','male','1623314836'),
('360100200305128659','南昌市','2003','05','12','male','1623314852'),
('33010019991106480X','杭州市','1999','11','06','female','1623314875'),
('440100200602171442','广州市','2006','02','17','female','1623314899'),
('520500200811013258','毕节市','2008','11','01','male','1623315092'),
('310000199909052464','上海市','1999','09','05','female','1623315109'),
('411722200809170734','上蔡县','2008','09','17','male','1623315135');

/*Table structure for table `test` */

DROP TABLE IF EXISTS `test`;

CREATE TABLE `test` (
  `name` varchar(30) NOT NULL,
  `height` int(60) DEFAULT NULL,
  PRIMARY KEY (`name`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

/*Data for the table `test` */

insert  into `test`(`name`,`height`) values 
('李皇',178),
('陈陶',175),
('阿奋',176),
('拉苏',185);

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
